src/Catalogs/СкидкиНаценки/СкидкиНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкидкиНаценки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КорневаяГруппа</name>
    </items>
  </predefined>
  <attributes>
    <name>ВалютаПредоставления</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыСовместногоПримененияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПредоставления</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.СпособыПредоставленияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Управляемая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКартыЛояльности</name>
    <type>
      <types>CatalogRef.ВидыКартЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментПодарков</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКратность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеДляСкидкиКоличеством</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПсихологическоеОкругление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПримененияСкидки</name>
    <type>
      <types>EnumRef.СпособыПримененияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.БонусныеПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаРезультатаСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыРасчетаРезультатаСовместногоПрименения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтбораНоменклатуры</name>
    <type>
      <types>EnumRef.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатурыОграничения</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыВнешнейОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленДополнительныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименятьУмножениеВРамкахВышестоящейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияПредоставления</name>
    <attributes>
      <name>УсловиеПредоставления</name>
      <type>
        <types>CatalogRef.УсловияПредоставленияСкидокНаценок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/СпособыПредоставленияСкидокНаценок/СпособыПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПредоставленияСкидокНаценок</name>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>СуммаДляКаждойСтроки</name>
  </enumValues>
  <enumValues>
    <name>Количество</name>
  </enumValues>
  <enumValues>
    <name>Процент</name>
  </enumValues>
  <enumValues>
    <name>ВидЦены</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>КартаЛояльности</name>
  </enumValues>
  <enumValues>
    <name>Подарок</name>
  </enumValues>
  <enumValues>
    <name>ОкруглениеСуммы</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СпособыПримененияСкидокНаценок/СпособыПримененияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПримененияСкидокНаценок</name>
  <enumValues>
    <name>ПрименитьВМоментРасчетаСкидокНаценок</name>
  </enumValues>
  <enumValues>
    <name>НачислитьБонусныеБаллы</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок/ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок</name>
  <enumValues>
    <name>СегментНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>СписокНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОтборКомпоновкиДанных</name>
  </enumValues>
  <enumValues>
    <name>БезОграничений</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <attributes>
    <name>ВалютаЦены</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеМеждуОрганизациями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриВыпускеПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаданияЦены</name>
    <type>
      <types>EnumRef.СпособыЗаданияЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСрабатывания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Округлять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЦенуПриВводеНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПередачеПродукцииДавальцу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОкругления</name>
    <type>
      <types>EnumRef.ВариантыОкругления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВлияющиеВидыЦен</name>
    <attributes>
      <name>ВлияющийВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаОкругленияЦены</name>
    <attributes>
      <name>НижняяГраницаДиапазонаЦен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочностьОкругления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическоеОкругление</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПорогиСрабатывания</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорогСрабатывания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СкидкиНаценки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ЭтоГруппа Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Наименование");
		
		Если Ссылка = Справочники.СкидкиНаценки.КорневаяГруппа Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Родитель");
		КонецЕсли;
		
	Иначе
		
		Если СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦены Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВидЦены");
		КонецЕсли;
		
		Если (СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.Сумма
			И СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.ОкруглениеСуммы
			И СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.СуммаДляКаждойСтроки)
			И СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.ПрименитьВМоментРасчетаСкидокНаценок Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВалютаПредоставления");
		КонецЕсли;
		
		Если СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.НачислитьБонусныеБаллы Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВалютаПредоставления");
		КонецЕсли;
		
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦены
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.СуммаДляКаждойСтроки Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			
		ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.КартаЛояльности
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ЗначениеСкидкиНаценки");
			
			Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.КартаЛояльности Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			КонецЕсли;
			Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
			КонецЕсли;
			
		КонецЕсли;
		
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ОкруглениеСуммы Тогда
			
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
			
			Если ЗначениеЗаполнено(ТочностьОкругления) И
				ПсихологическоеОкругление >= ТочностьОкругления Тогда
				
				ТекстОшибки = НСтр("ru='Психологическое округление должно быть меньше точности округления';uk='Психологічне округлення повинно бути менше точності округлення'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					"ПсихологическоеОкругление",
					,
					Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.ОкруглениеСуммы Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТочностьОкругления");
		КонецЕсли;
		
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Подарок
			ИЛИ СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Количество Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
		КонецЕсли;
		
		Если СпособПримененияСкидки <> Перечисления.СпособыПримененияСкидокНаценок.НачислитьБонусныеБаллы Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПериодДействия");
			МассивНепроверяемыхРеквизитов.Добавить("КоличествоПериодовДействия");
			МассивНепроверяемыхРеквизитов.Добавить("ПериодОтсрочкиНачалаДействия");
			МассивНепроверяемыхРеквизитов.Добавить("КоличествоПериодовОтсрочкиНачалаДействия");
			МассивНепроверяемыхРеквизитов.Добавить("БонуснаяПрограммаЛояльности");
		КонецЕсли;
		
		Если ТипЗнч(СпособПредоставления) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТекстСообщения");
			МассивНепроверяемыхРеквизитов.Добавить("ВидКартыЛояльности");
		КонецЕсли;
			
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Количество Тогда
			Если ЗначениеСкидкиНаценки >= УсловиеДляСкидкиКоличеством Тогда
			
				ТекстОшибки = НСтр("ru='Количество бесплатного товара должно быть меньше общего количества данного товара""';uk='Кількість безкоштовного товару повинна бути менше загальної кількості даного товару""'");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстОшибки,
					ЭтотОбъект,
					"ЗначениеСкидкиНаценки",
					,
					Отказ);
				
			КонецЕсли;
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("УсловиеДляСкидкиКоличеством");
		КонецЕсли;
		
		Если ВариантОтбораНоменклатуры <> Перечисления.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок.СегментНоменклатуры Тогда
			МассивНепроверяемыхРеквизитов.Добавить("СегментНоменклатурыОграничения");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ОчиститьНеиспользуемыеРеквизиты();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда
		
		ВалютаПредоставления = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(ВалютаПредоставления);
		ВидЦены = Справочники.ВидыЦен.ВидЦеныПоУмолчанию(ВидЦены);
		
		Если ДанныеЗаполнения.Свойство("СпособПредоставления")
			И ТипЗнч(ДанныеЗаполнения.СпособПредоставления) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
			
			ВнешняяОбработка = СкидкиНаценкиПовтИсп.ОбъектВнешнейОбработки(ДанныеЗаполнения.СпособПредоставления);
			УстановитьБезопасныйРежим(Истина);
			СпособПримененияСкидки = ВнешняяОбработка.СпособПрименения();
			УстановитьБезопасныйРежим(Ложь);
			
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ДанныеДляЗаполненияРодителя")
			И ЗначениеЗаполнено(ДанныеЗаполнения.ДанныеДляЗаполненияРодителя) Тогда
			
			Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.ДанныеДляЗаполненияРодителя, "Родитель");
			Если Не ЗначениеЗаполнено(Родитель) Тогда
				Родитель = Справочники.СкидкиНаценки.КорневаяГруппа;
			КонецЕсли;
			
		Иначе
			
			Родитель = Справочники.СкидкиНаценки.КорневаяГруппа;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ОчиститьНеиспользуемыеРеквизиты()

	Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.ВидЦены Тогда
		
		ВалютаПредоставления = Неопределено;
		ЗначениеСкидкиНаценки = Неопределено;
		
		ТекстСообщения = Неопределено;
		ВидКартыЛояльности = Неопределено;
		
		ЦеновыеГруппы.Очистить();
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Процент Тогда
		
		Если СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.ПрименитьВМоментРасчетаСкидокНаценок Тогда
			ВалютаПредоставления = Неопределено;
		КонецЕсли;
		
		ВалютаПредоставления = Неопределено;
		ВидЦены              = Неопределено;
		
		ТекстСообщения = Неопределено;
		ВидКартыЛояльности = Неопределено;
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сумма Тогда
		
		ВидЦены = Неопределено;
		
		ТекстСообщения = Неопределено;
		ВидКартыЛояльности = Неопределено;
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Сообщение Тогда
		
		ЗначениеСкидкиНаценки = Неопределено;
		ВалютаПредоставления = Неопределено;
		ВидЦены              = Неопределено;
		
		ЦеновыеГруппы.Очистить();
		ВидКартыЛояльности = Неопределено;
		
	ИначеЕсли СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.КартаЛояльности Тогда
		
		ЗначениеСкидкиНаценки = Неопределено;
		ВалютаПредоставления = Неопределено;
		ВидЦены              = Неопределено;
		
		ЦеновыеГруппы.Очистить();
		ТекстСообщения = Неопределено;
		
	КонецЕсли;
	
	Если Не ЭтоГруппа И СпособПримененияСкидки <> Перечисления.СпособыПримененияСкидокНаценок.НачислитьБонусныеБаллы Тогда
		БонуснаяПрограммаЛояльности = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
